import h_s2_1 from "@/assets/production/production_s2/DSC08836.jpg";
import h_s2_2 from "@/assets/production/production_s2/DSC09008.jpg";

import pr_s2_1_edited from "@/assets/production/production_s2/DEW05948.jpg"
import pr_s2_1 from "@/assets/production/production_s2/DEW05776.jpg"
import pr_s2_2 from "@/assets/production/production_s2/DEW06167.jpg"
import pr_s2_3 from "@/assets/production/production_s2/DEW06318.jpg"

import pr_s4_1 from "@/assets/production/production_s4/image_2025-07-07_21-48-18.png"
import pr_s4_1_element from "@/assets/production/production_s4/image_2025-07-07_21-48-31.png"

import pr_s4_2 from "@/assets/production/production_s4/image_2025-07-07_21-48-44.png"
import pr_s4_2_element from "@/assets/production/production_s4/image_2025-07-07_21-48-54.png"

import pr_s4_3 from "@/assets/production/production_s4/image_2025-07-07_21-49-26.png"
import pr_s4_3_element from "@/assets/production/production_s4/image_2025-07-07_21-49-38.png"


export const Production_s2_ind_db = [
    {
        img_url: h_s2_1,
        // title:"Classic T-shirt 200",
        // price:"500"
    },
    {
        img_url: h_s2_2,
        // title:"Classic T-shirt 200",
        // price:"500"
    }
]

export const Production_s2_db = {
    i1: {
        h1: "Отдел разработки",
        paragraphs: `Отдел моделирования играет основную роль в текстильной промышленности. Наши высококвалифицированные специалисты могут создать все виды трикотажных изделий согласно требованиям заказчика. Также умеют грамотно работать по технической документации заказчика. Кроме того, наша команда следит за сезонными коллекциями и прилагает все усилия, чтобы на постоянной основе, предлагать нашим клиентам самые современные и модные изделия.`,
        btn: "Свяжитесь",
        photo: pr_s2_1_edited
    },
    i2: {
        h1: "Закройный отдел",
        paragraphs: `Закройный отдел оснащен тремя самыми современными технологиями. Автоматическая машина для резки, ручная резка и автоматическая машина для настила. Этот цех занимается раскроем тканей, мощность которого, 60 000-70 000 тысяч раскроев в сутки. Это большая ответственность за производство качественной одежды. Перед раскроем полотна наши специалисты тщательно следят за качеством и проводят различные тесты в соответствии с международными стандартами с модельно-конструкторным отделом.`,
        btn: "Продукция",
        photo: pr_s2_1
    },
    i3: {
        h1: "Швейный отдел",
        paragraphs:"Ежедневная производительность швейного цеха для базовых моделей от 60 000 до 70 000 готовых изделий. Для чёткого контроля и эффективной работы привлекаются квалифицированные специалисты. На фабрике только последние марки швейных машин. Мы производим все виды детского, мужского и женского трикотажа – футболки, рубашки-поло, блузки, спортивные костюмы, брюки, легинсы, шорты, юбки, костюмы, пижамы. и т.д.",
        btn: "Свяжитесь",
        photo: pr_s2_2
    },
    i4: {
        h1: "Гладильно-упаковочный отдел",
        paragraphs: `Гладильный участок — это заключительный этап, где каждая деталь обретает безупречный вид.
Здесь работают профессионалы, владеющие современным оборудованием и точной технологией обработки. <br/><br/>
Благодаря правильной температуре, давлению и аккуратности, изделия приобретают презентабельный вид и готовы к упаковке или отправке.
Мы придаём значение каждому изгибу ткани — ведь именно из мелочей складывается ощущение качества.
`,
        btn: "Контакты",
        photo: pr_s2_3
    },
}


export const Production_s4_db = [
    {
        img_url: [pr_s4_1_element, pr_s4_1]
    },
    {
        img_url: [pr_s4_2_element, pr_s4_2]
    },
    {
        img_url: [pr_s4_3_element, pr_s4_3]
    },

]